Attribute VB_Name = "Mod01_DumpMCode"
'***************************************************************************************************
'                 選択したBookにあるPowerQueryのソースコードを指定フォルダに出力します
'***************************************************************************************************
Option Explicit



'***************************************************************************************************
'                                   ■■■ セルの名前一覧 ■■■
'***************************************************************************************************
Public Const RangeName_BeforePathName As String = "前回の出力先パス"



'***************************************************************************************************
'                           ■■■ アドインから呼び出すプロシージャ名 ■■■
'***************************************************************************************************
'* 機能　　：一連の処理をまとめて、PowerQueryのソースコードを指定フォルダに出力します
'---------------------------------------------------------------------------------------------------
'* 注意事項：現時点では、グループ名の取得に非対応です
'***************************************************************************************************
Sub StartDumpPowerQuerySource()
    '開いているBook名を配列に格納
    Dim OpeningBooksList: OpeningBooksList = OpeningBooks

    'リストをタスクダイアログに渡します
    tdl01_DumpForm.TaskDialogShow OpeningBooksList
End Sub



'***************************************************************************************************
'                                   ■■■ 各種情報収集 ■■■
'***************************************************************************************************
'* 機能　　：現在開いているBook名を確認します
'---------------------------------------------------------------------------------------------------
'* 返り値　：現在開いているBook名の1次元配列
'***************************************************************************************************
Private Function OpeningBooks()
    '必要な変数を用意
    Dim wb As Workbook
    Dim bookNames() As String
    Dim i As Long

    '開いているBook数で、配列を拡張
    ReDim bookNames(1 To Application.Workbooks.Count)

    '順次、入れていきます
    i = 1
    For Each wb In Application.Workbooks
        bookNames(i) = wb.Name
        i = i + 1
    Next

    '返却
    OpeningBooks = bookNames
End Function
