Attribute VB_Name = "Mod04_TimeMeasurement"
'***************************************************************************************************
'                                  マクロの処理速度計測機能です
'***************************************************************************************************
Option Explicit



'***************************************************************************************************
'                               ■■■ グローバル変数として保持 ■■■
'***************************************************************************************************
Dim g_TimerStart As Double      '開始時の時刻記録
Dim g_LastLap As Double         'ラップ時の時刻記録
Dim g_LapCount As Long          'ラップカウント
Dim g_TimerRunning As Boolean   'タイマー稼働フラグ



'***************************************************************************************************
'                           ■■■ アドインから呼び出すプロシージャ ■■■
'***************************************************************************************************
'* 機能　　：タイマー開始またはラップタイム取得します
'---------------------------------------------------------------------------------------------------
'* 引数　　：Title   計測開始、ラップ時のタイトルを付与して、どういう処理をしてるかの簡潔説明にどうぞ
'---------------------------------------------------------------------------------------------------
'* 機能説明：呼び出すたびに Debug.Print に経過時間を表示します（初回は「開始」扱い）
'* 注意事項：1日をまたぐケースではズレます。23:59 あたりになったら一旦、待ちましょう。つまり上限は、24hです。
'***************************************************************************************************
Sub StartOrLapTimer(Optional Title As String)
    '0時からの経過時間を取得
    Dim currentTime As Double: currentTime = Timer

    '初回実行かの判定
    If Not g_TimerRunning Then
        '初期化
        g_TimerStart = currentTime
        g_LastLap = currentTime
        g_LapCount = 0
        g_TimerRunning = True
        
        'イミディエイトに出力
        Debug.Print "▼計測開始: " & Title
    Else
        'カウントUP
        g_LapCount = g_LapCount + 1
        
        'イミディエイトにラップを出力
        If Title <> "" Then Title = " (" & Title & ")"
        Debug.Print "→ラップ " & g_LapCount & Title & " : " & Format(currentTime - g_LastLap, "0.000") & " 秒"
        
        '時刻を更新
        g_LastLap = currentTime
    End If
End Sub


'***************************************************************************************************
'* 機能　　：タイマーを終了します
'---------------------------------------------------------------------------------------------------
'* 引数　　：Title   計測終了時のタイトルを付与して、どういう処理をしてるかの簡潔説明にどうぞ
'---------------------------------------------------------------------------------------------------
'* 機能説明：最終経過時間を表示して、タイマーをリセットします。1ラップ以上ある場合は、最後のラップも表示します
'***************************************************************************************************
Sub EndTimer(Optional Title As String)
    If g_TimerRunning Then
        '0時からの経過時間を取得
        Dim currentTime As Double: currentTime = Timer
        
        'イミディエイトに出力
        If Title <> "" Then Title = " (" & Title & ")"
        If g_LapCount > 0 Then Debug.Print "→ラップ " & g_LapCount + 1 & Title & " : " & Format(currentTime - g_LastLap, "0.000") & " 秒"
        
        Debug.Print "■計測終了: " & Format(currentTime - g_TimerStart, "0.000") & " 秒 (合計)" & vbCrLf
    Else
        Debug.Print "×タイマーは動いていません。"
    End If
    
    '停止モードにしておく
    g_TimerRunning = False
End Sub
