Attribute VB_Name = "Mod98_WindowsAPI"
'***************************************************************************************************
'                                   WindowsAPI宣言モジュール
'---------------------------------------------------------------------------------------------------
'           ただし、複雑な処理はここには記述しません。基本的に宣言と簡易仕様関数とすること
'***************************************************************************************************


'***************************************************************************************************
Option Explicit
'===================================================================================================



'***************************************************************************************************
'                               ■■■ SHCreateDirectoryEx 宣言 ■■■
'***************************************************************************************************
Private Declare PtrSafe Function SHCreateDirectoryEx Lib "Shell32" _
    Alias "SHCreateDirectoryExA" _
    (ByVal hWnd As LongPtr, _
     ByVal pszPath As String, _
     ByVal psa As LongPtr) As Long



'***************************************************************************************************
'                         ■■■ WindowsAPIを使えるように関数を簡易実装 ■■■
'***************************************************************************************************
'* 機能：SHCreateDirectoryEx　を利用して多階層フォルダを一気に作成します。
'---------------------------------------------------------------------------------------------------
'* 返り値　：0      正常にフォルダが作成された場合
'            161    パスの記述が不正
'            183    フォルダが既に存在している場合
'
'* 引数　　：fullPassDir      作成するフォルダまでのフルパス
'---------------------------------------------------------------------------------------------------
'注意事項：その他のエラーコードは、https://learn.microsoft.com/ja-jp/windows/win32/debug/system-error-codes--0-499-　で
'          とはいえ、上記3つ以外は、基本エラーと考えてよいです。
'***************************************************************************************************
Function BatchCreationFolder(fullPassDir As String) As Long
    
    BatchCreationFolder = SHCreateDirectoryEx(0, fullPassDir, 0)

End Function
